[{
  "type": "applications",
  "id": "spark",
  "title": "Sparkshot",
  "platforms": ["Web", "Lightning Network"],
  "genre": "Entertainment",
  "technology": ["Javascript", "Python", "HTML", "WebSockets", "CSS", "Photoshop", "Lightning Network"],
  "release": "2019",
  "company": "PrimeVR",
  "publisher": "PrimeVR",
  "team_size": 2,
  "dev_time": "3 months",
  "role": ["Lead Designer", "Programmer", "Artist"],
  "work": ["Design", "UI System", "UX Design", "Textures"],
  "trailer": "",
  "website": "https://sparkshot.io",
  "description": "<p>Sparkshot is a <a href=\"https://blog.lightning.engineering/posts/2018/05/02/lightning-ux.html\">Lightning Network</a> art platform upon which artists can upload their original artwork to the site and it is launched in a blank state. Users then purchase pixels and add personalised message using Bitcoin over the Lightning Network. This process slowly reveals the art whilst also adding a meta layer on top for each individual purchase. Observers can then view both the art as it appears as well as look at the posted messages and shapes of pixel groups.<p><h5>The Lightning Network</h5><p>The Lightning Network protocol allows for instant transactions to happen at near-zero fee, and in amounts as tiny as a fraction of a cent, achieving nano-scale payments across the internet with no requirement for a 3rd party payment provider like PayPal or Square.</p><h5>The Goal</h5><p>We understand that this is extremely new technology which requires a serious level of onboarding before it can be considered a viable business platform, however that process has to begin somewhere. So we set about building an application that could use an already popular medium such as images and adapt it into something that cannot be done with existing payment systems (sub-cent transactions aren't possible via existing payment services). It also had to be something that could grow but didn't require a large userbase in order for individuals to see the fun.</p>"
}, {
  "type": "applications",
  "id": "sparkw",
  "title": "Sparkshot Website",
  "platforms": ["Web"],
  "genre": "Education",
  "technology": ["Javascript", "HTML", "CSS", "Atom", "Photoshop", "Illustrator"],
  "release": "2018",
  "company": "PrimeVR",
  "publisher": "PrimeVR",
  "team_size": 2,
  "dev_time": "2 Weeks",
  "role": ["Lead Designer", "Programmer", "Artist"],
  "work": ["Design", "UI System", "UX Design", "Textures"],
  "trailer": "",
  "website": "https://sparkshot.io",
  "description": "<p>Prior to the release of Sparkshot our Lightning Network Art Platform, we wanted to launch something early so we could point people to so we created a website to help inform of the goal of the project as well as provide updates on its development.</p><h5>Development</h5><p>I produced the website using the <a href=\"https://materializecss.com\">Materialize</a> framework for the layout, buttons and other elements. Beyond that I generated all the graphics, the project logo, and built the interactive functionality using vanilla Javascript.</p>"
}, {
  "type": "applications",
  "id": "fork",
  "title": "Forkdrop",
  "platforms": ["Web"],
  "genre": "Education",
  "technology": ["Javascript", "HTML", "CSS", "Atom"],
  "release": "2018",
  "company": "PrimeVR",
  "publisher": "PrimeVR",
  "team_size": 2,
  "dev_time": "3 Months",
  "role": ["Lead Designer", "Programmer", "Artist"],
  "work": ["Design", "UI System", "UX Design", "Textures"],
  "trailer": "",
  "embed": "",
  "website": "https://forkdrop.io",
  "description": "<p>Forkdrop is a curated analysis of all known Bitcoin Forks and Altcoin Forks, on which cryptocurrency holders can research to see if they're eligible for any forked coins</p><h5>Bitcoin Forks</h5><p>During the last few months of 2017, we were looking at the trends that were happening in the cryptocurrency space. One thing of note was that after the Bitcoin fork which created Bitcoin Cash other groups saw the opportunity to also fork Bitcoin or one of the other cryptocurrencies in order to issue a new set of coins using different rules to govern from the original Bitcoin.<p><p>We predicted that this would become a growing trend which might be both interesting to track as well as create benefit for any holder who might find themselves owning forked coins. Second-to-being interesting, with the cryptocurrency space being like the wild west, it was highly probable that scams would take place. So having a site which tracked these projects and where users could report bad activity seemed like a good idea.</p><h5>Creation</h5><p>The web seemed like a perfect fit for this type of dataset, easy for users to find, and browsers having great capability for showing well presented searchable data.</p><p>We built the website using a number of open source frameworks, namely: <a href=\"https://materializecss.com\">Materialize</a> for the layout and <a href=\"https://www.ag-grid.com/\">ag-grid</a> for the data table. The site pages are pre-generated from a dataset via a python codebase, which allows us to update and add to the site by updating the dataset.</p><p>One of the challenging aspects of the project was to take the concept of a cryptocurrency fork and form a standardized dataset from it, then present that data in such a way to be useful for a general cryptocurrency holder. The presentation UI helped show the data off in an easy to observe way, but where possible we included help hints to fully explain each part.</p><p>The final major component is the Guides section, which takes a different approach and steps through the concept as a set of instructions to help users claim their forked coins</p><h5>Take Away</h5><p>Forkdrop provided with a great challenge to create and an opportunity to learn a lot of about Web App development, deployment, hosting, and SEO (We successfully reached #2 in Google's index for Bitcoin Forks). The project has proved valuable to our users and has become the major source of data on fork coins. Thanks to how we created the site to allow for easy updating means we'll be happy to support it for years to come.</p>"
}]
